{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"module_wrapper_9_input": {"name": "module_wrapper_9_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"module_wrapper_17": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_wrapper_9_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd", "op": "_FusedMatMul", "input": ["module_wrapper_9_input", "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd", "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "shape": [3, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/MatMul/ReadVariableOp", "shape": [3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_12/dense_12/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_13/dense_13/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_14/dense_14/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_15/dense_15/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_16/dense_16/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/MatMul/ReadVariableOp", "shape": [64, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_17/dense_17/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}